app/views/leave_applications/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
          <th class="applied-th-2">Email</th>
          <th class="applied-th-3">Requested Date</th>
          <th class="applied-th-4">Category</th>
          <th style="applied-th-7">Reason</th>
          <th class="applied-th-6">Approval</th>
        </tr>
        <% @array.each do |f| %>
          <tr>
            <td> <%= f.user.email %> </td>
            <td>
              <%= f.leave_date %>
            </td>
            <td> <%= f.category %> </td>
            <td> <%= f.description %> </td>
            <td class="approval-col">
              <% if f.approved == 'N/A' %>
                <div class="pending">
                  <span>Pending</span>
                </div>
              <% elsif f.approved == 'Approved :)' %>
                <div class="approved">
                  <span>Approved :)</span>